app/controllers/singers_controller.rb

SELECT "singers".* FROM "singers"
---
  def index
    @singers = Singer.all

SELECT "singers".* FROM "singers" WHERE "singers"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    @singer = Singer.find(params[:id])

SELECT "singers".* FROM "singers" WHERE "singers"."id" = ? LIMIT 1  [["id", "2"]]
---
  def edit
    @singer = Singer.find(params[:id])

INSERT INTO "singers" ("bio", "created_at", "lastname", "name", "skill", "updated_at", "voicepart") VALUES (?, ?, ?, ?, ?, ?, ?)  [["bio", ""], ["created_at", Thu, 07 Feb 2013 02:48:02 UTC +00:00], ["lastname", ""], ["name", ""], ["skill", ""], ["updated_at", Thu, 07 Feb 2013 02:48:02 UTC +00:00], ["voicepart", ""]]
---
  def create
    @singer = Singer.new(params[:singer])

    respond_to do |format|
      if @singer.save

SELECT "singers".* FROM "singers" WHERE "singers"."id" = ? LIMIT 1  [["id", "1"]]
DELETE FROM "singers" WHERE "singers"."id" = ?  [["id", 1]]
---
  def destroy
    @singer = Singer.find(params[:id])
    @singer.destroy