app/controllers/techies_controller.rb

  def index
    @techies = Techie.all
---
SELECT "techies".* FROM "techies"

  def show
    @techy = Techie.find(params[:id])
---
SELECT "techies".* FROM "techies" WHERE "techies"."id" = ? LIMIT 1  [["id", "1"]]

  def edit
    @techy = Techie.find(params[:id])
---
SELECT "techies".* FROM "techies" WHERE "techies"."id" = ? LIMIT 1  [["id", "1"]]

  def create
    @techy = Techie.new(params[:techy])

    respond_to do |format|
      if @techy.save
---
INSERT INTO "techies" ("bio", "created_at", "lastname", "name", "position", "skill", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["bio", nil], ["created_at", Thu, 07 Feb 2013 03:16:35 UTC +00:00], ["lastname", nil], ["name", nil], ["position", nil], ["skill", nil], ["updated_at", Thu, 07 Feb 2013 03:16:35 UTC +00:00]]

  def update
    @techy = Techie.find(params[:id])
---
SELECT "techies".* FROM "techies" WHERE "techies"."id" = ? LIMIT 1  [["id", "1"]]

  def destroy
    @techy = Techie.find(params[:id])
    @techy.destroy
---
SELECT "techies".* FROM "techies" WHERE "techies"."id" = ? LIMIT 1  [["id", "1"]]
DELETE FROM "techies" WHERE "techies"."id" = ?  [["id", 1]]